docs/research/linear-or-gc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-07 Wed 11:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="林子篆" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3013c39">1. Linear or GC</a>
<ul>
<li><a href="#orgbeaac8a">1.1. Abstraction</a></li>
<li><a href="#org644fb74">1.2. Introduction</a></li>
<li><a href="#org4365651">1.3. Approach</a></li>
<li><a href="#org5cd4164">1.4. First Language</a>
<ul>
<li><a href="#org99b89cb">1.4.1. Formal tree</a></li>
<li><a href="#orgb0401b0">1.4.2. Properties</a></li>
<li><a href="#org1580465">1.4.3. Algorithm</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org99dcac1">2. reference</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3013c39" class="outline-2">
<h2 id="org3013c39"><span class="section-number-2">1</span> Linear or GC</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbeaac8a" class="outline-3">
<h3 id="orgbeaac8a"><span class="section-number-3">1.1</span> Abstraction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This research idea was about a linear liveness analysis with fall back to GC. Ideally, most GC object would be <b><b>Tenured</b></b>, rest object get released immediately. But notice the special type like <code>File</code>, <code>NetworkPort</code> would need some special treatment, and small(size) type like <code>i32</code>, <code>i64</code>, and <code>f32</code> no need to analysis.
</p>
</div>
</div>

<div id="outline-container-org644fb74" class="outline-3">
<h3 id="org644fb74"><span class="section-number-3">1.2</span> Introduction</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Linear logic restrict a property can be traced statically, memory allocation problem is a kind of application. For example, once we know a variable <code>a</code> never used after line <code>k</code>, we can deallocate <code>a</code> at line <code>k+1</code>. To analyze it, we can do full scope analysis, which means analyze function by dependency, the problem is such method required full information and won't work well with compiled language which erased most information from source code. Therefore, the way we choose is analyzing independently by each function, in this approach, although it can't analyze some cases and required some helps from programmer, we can get a local analyzing based on function and a little bit type information of others function but no need to wait analyzing result of others function, algorithm can be a lot faster.
</p>
</div>
</div>

<div id="outline-container-org4365651" class="outline-3">
<h3 id="org4365651"><span class="section-number-3">1.3</span> Approach</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Under our method, we need to distinguish ownership of an object, according to our purpose was a general method for all languages, we have three cases:
</p>

<ol class="org-ol">
<li>A variable directly to an object(<code>T</code>)</li>
<li>A reference to an object(<code>*T</code>)</li>
<li>A GC reference to an object(<code>*T</code>)</li>
</ol>

<p>
GC and raw reference(pointer) might look like the same thing, but since we're analyzing liveness, then a GC object would live anywhere, but raw one won't, this is reason why we distinguish them.
</p>

<p>
In our perspective, to unify general liveness property in different language, we also have tree kinds of object. Ignoring copy since they would be fine in any kinds of memory model, and then we can ignore different between reference and value, since value type is unimportant in our framework. Now we say we only have:
</p>

<ol class="org-ol">
<li>owned object</li>
<li>shared object</li>
<li>global shared object</li>
</ol>

<p>
Owned is simple, we totally have this object, we can delete it once at the end of the scope or move it to other owner. Shared means we didn't own it, but we can use it, we must distinguish this since captured can't take a shared object out of scope(notice that if stay in the same scope then it's allowed). Global shared means the object would live whatever where it is, which mean it's a GC object.
</p>
</div>
</div>

<div id="outline-container-org5cd4164" class="outline-3">
<h3 id="org5cd4164"><span class="section-number-3">1.4</span> First Language</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Since we need to get help from type message, this is a static typed language, in this version we ignore special resource like <code>File</code> first. Another thing is the language is pure and reject side effect. And to simplify algorithm, small size type still get analyzing. The following shows some examples.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">define variable</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">x</span> <span style="color: #3a81c3;">:</span> i32 <span style="color: #2e8b57;">'i32</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">define function</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">add</span> <span style="color: #3a81c3;">:</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">-&gt;</span> i32 i32 i32<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">[</span>x <span style="color: #3a81c3;">:</span> i32<span style="color: #67b11d;">]</span> <span style="color: #67b11d;">[</span>y <span style="color: #3a81c3;">:</span> i32<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span> <span style="color: #3a81c3;">:</span> i32
    <span style="color: #2d9574;">(</span><span style="color: #3a81c3;">+</span> x y<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">foo</span> <span style="color: #3a81c3;">:</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">-&gt;</span> <span style="color: #2d9574;">()</span> i32<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">x</span> <span style="color: #3a81c3;">:</span> i32 <span style="color: #2e8b57;">'i32</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #2d9574;">()</span> <span style="color: #3a81c3;">:</span> i32
    <span style="color: #2d9574;">(</span><span style="color: #3a81c3;">+</span> x <span style="color: #2e8b57;">'i32</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">function call</span>
<span style="color: #3a81c3;">(</span>add <span style="color: #2e8b57;">'i32</span> <span style="color: #2e8b57;">'i32</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org99b89cb" class="outline-4">
<h4 id="org99b89cb"><span class="section-number-4">1.4.1</span> Formal tree</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Then we have a formal tree, and primitive function would be introduced in anytime by need.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">stmt</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">~var</span> <span style="color: #3a81c3;">:</span> ~typ ~exp<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">exp</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">exp</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>~var* <span style="color: #3a81c3;">:</span> ~typ*<span style="color: #2d9574;">]</span> <span style="color: #3a81c3; font-weight: bold;">...</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3;">:</span> ~typ
  ~stmt* <span style="color: #3a81c3; font-weight: bold;">...</span>
  ~exp<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>~var ~exp* <span style="color: #3a81c3; font-weight: bold;">...</span><span style="color: #3a81c3;">)</span>
<span style="color: #2e8b57;">'exp</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">any atom can be value, 'i32 represented value of i32</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0401b0" class="outline-4">
<h4 id="orgb0401b0"><span class="section-number-4">1.4.2</span> Properties</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
We can get simple think for these.
</p>
</div>
<ol class="org-ol">
<li><a id="org5af9b9e"></a>parameter and returns belongs to upper scope<br /></li>
<li><a id="orgdbf609a"></a>variable belongs to current scope<br />
<ol class="org-ol">
<li><a id="org13dba32"></a>variable be referenced by returned value is a moved out<br /></li>
<li><a id="org9a620b6"></a>variable end in current scope is linear<br /></li>
<li><a id="org96a1610"></a>variable be captured by a lambda is un-analyzable<br /></li>
</ol>
</li>
<li><a id="org94e7fc5"></a>function call would get a value, the value belongs to caller scope<br /></li>
</ol>
</div>

<div id="outline-container-org1580465" class="outline-4">
<h4 id="org1580465"><span class="section-number-4">1.4.3</span> Algorithm</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Now can define the algorithm.
</p>
</div>
<ol class="org-ol">
<li><a id="org76a85e8"></a>analysis works for every single scope<br /></li>
<li><a id="org8ff9d4a"></a>define introduces a new variable<br /></li>
<li><a id="org4e33a6f"></a>lambda introduces a new scope<br /></li>
<li><a id="org8c8faa9"></a>by default, variable allocated by GC<br /></li>
<li><a id="orgbd52d69"></a>lifetime who can be detected by algorithm use allocate/deallocate directly in that scope<br /></li>
<li><a id="org08dad65"></a>parameter and returned value can't be detected by algorithm<br /></li>
<li><a id="org33e29b9"></a>captured by lambda can't be detected by algorithm<br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org99dcac1" class="outline-2">
<h2 id="org99dcac1"><span class="section-number-2">2</span> reference</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://www.fos.kuis.kyoto-u.ac.jp/~igarashi/papers/pdf/lgc.TIC00.rev.pdf">Garbage Collection Based on a Linear Type System</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 林子篆</p>
<p class="date">Created: 2020-10-07 Wed 11:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
